In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'sex' : ['M', 'F', np.nan, 'M', 'F'],
                   'score' : [5, 4, 3, 4, np.nan]}) # 결측치 값이 있는 데이터 프레임
df

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0
4    F    NaN

In [4]:
df['score'] + 1 # 결측치가 있으면 연산 결과도 NaN

0    6.0
1    5.0
2    4.0
3    5.0
4    NaN
Name: score, dtype: float64

In [7]:
pd.isna(df) # 결측치 확인

     sex  score
0  False  False
1  False  False
2   True  False
3  False  False
4  False   True

In [8]:
pd.isna(df).sum() # 결측치 빈도 확인

sex      1
score    1
dtype: int64

In [10]:
df.dropna(subset = ['score']) # score 결측치 제거

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0

In [12]:
df_nomiss = df.dropna(subset=['score']) # 결측치가 제거된 데이터 만들기
df_nomiss['score'] + 1 # 연산하면 결측치가 제거되어 출력

0    6.0
1    5.0
2    4.0
3    5.0
Name: score, dtype: float64

In [14]:
df_nomiss = df.dropna(subset=['score', 'sex']) # 여러 변수에서 결측치 제거
df_nomiss

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

In [16]:
df_nomiss = df.dropna() # 변수를 지정하지 않으면 모든 행에서 결측치 제거
df_nomiss

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

In [18]:
exam = pd.read_csv('exam.csv')
exam.loc[[2,7,14], ['math']] = np.nan #  math 열의 2,7,14 행에 Nan 할당
exam

    id  nclass  math  english  science
0    1       1  50.0       98       50
1    2       1  60.0       97       60
2    3       1   NaN       86       78
3    4       1  30.0       98       58
4    5       2  25.0       80       65
5    6       2  50.0       89       98
6    7       2  80.0       90       45
7    8       2   NaN       78       25
8    9       3  20.0       98       15
9   10       3  50.0       98       45
10  11       3  65.0       65       65
11  12       3  45.0       85       32
12  13       4  46.0       98       65
13  14       4  48.0       87       12
14  15       4   NaN       56       78
15  16       4  58.0       98       65
16  17       5  65.0       68       98
17  18       5  80.0       78       90
18  19       5  89.0       68       87
19  20       5  78.0       83       58

In [20]:
exam['math'].mean() # math 의 평균값

55.23529411764706

In [22]:
exam['math'] = exam['math'].fillna(55) # math가 NaN 인 행을 55(평균값)로 대체하여 오차 줄이기
exam

    id  nclass  math  english  science
0    1       1  50.0       98       50
1    2       1  60.0       97       60
2    3       1  55.0       86       78
3    4       1  30.0       98       58
4    5       2  25.0       80       65
5    6       2  50.0       89       98
6    7       2  80.0       90       45
7    8       2  55.0       78       25
8    9       3  20.0       98       15
9   10       3  50.0       98       45
10  11       3  65.0       65       65
11  12       3  45.0       85       32
12  13       4  46.0       98       65
13  14       4  48.0       87       12
14  15       4  55.0       56       78
15  16       4  58.0       98       65
16  17       5  65.0       68       98
17  18       5  80.0       78       90
18  19       5  89.0       68       87
19  20       5  78.0       83       58

In [25]:
exam['math'].isna().sum() # 결측치 빈도 확인

0

In [32]:
# 첫 번째 혼자서 해보기
# Q1
mpg = pd.read_csv('mpg.csv')
mpg.loc[[64,123,130,152,211], 'hwy'] = np.nan # 각 행에  NaN 할당

mpg['drv'].isna().sum() # drv 에는 결측치가 없음
mpg['hwy'].isna().sum() # hwy 에 결측치 5개 있음

5

In [37]:
# Q2
# dropna() 로 결측치 제거 - groupby() 로 drv 별 분리 - drv 별 hwy 의 평균 구하기
mpg.dropna(subset = ['hwy'])\
    .groupby('drv')\
    .agg(mean_hwy = ('hwy', 'mean'))

      mean_hwy
drv
4    19.242424
f    28.200000
r    21.000000

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
0,audi,a4,1.8,1999,4,auto(l5),f,18,29.0,p,compact
1,audi,a4,1.8,1999,4,manual(m5),f,21,29.0,p,compact
2,audi,a4,2.0,2008,4,manual(m6),f,20,31.0,p,compact
3,audi,a4,2.0,2008,4,auto(av),f,21,30.0,p,compact
4,audi,a4,2.8,1999,6,auto(l5),f,16,26.0,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28.0,p,midsize
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29.0,p,midsize
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26.0,p,midsize
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26.0,p,midsize
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26.0,p,midsize